<?xml version="1.0" encoding="ISO-8859-1" ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">

<html xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1" />
    <meta http-equiv="Content-Language" content="pt-br" />
    <meta name="description" lang="pt-br" content="Yaw Tecnologia &eacute; uma empresa de desenvolvimento de Software, treinamentos, cursos Java, cursos de An&aacute;lise de Requisitos" />
    <meta name="keywords" lang="pt-br" content="curso de java, cursos java, cursos de java, treinamentos java, aprendendo java, cursos java no abc, treinamentos java grande abc" />
    <link rel="shortcut icon" href="/favicon.ico" type="image/x-icon" />
    
    <link rel="stylesheet" type="text/css" href="/css/yaw.css" />
    <title>YaW Tecnologia - Curso Fundamentos e L&oacute;gica de Programa&ccedil;&atilde;o</title>
    
  </head>

  <body>
    <div id="wrapper">
      <div id="content">
        <img src="/images/logo_ac_programador_.png" style="margin: 0pt 5px;" alt="Logo Academia Programador" title="Carreira Academia Programador" align="left"/>
        <br/>
        <br/>
        <h2>Academia do Programador</h2><br/>
        <br/><br/>
        <ul>
        	<li>Quer aprender L&oacute;gica de programa&ccedil;&atilde;o com muita pr&aacute;tica?</li>
        	<li>Como funciona os "bastidores" dos programas de computador?</li>
        	<li>Como utilizar uma linguagem de programa&ccedil;&atilde;o?</li>
        	<li>Porque usar Banco de dados?</li>
        	<li>Al&eacute;m do navegador, como funciona Web?</li>
        	<li>Como &eacute; o dia-a-dia de um programador?</li>
        </ul>
		<br/>
        <span class="boldTitle">Essas e outras perguntas são respondidas durante a Academia do Programador!</span><br/><br/>

        <p>Academia do Programador foi projetado para quem gosta ou tem afinidade com computadores e tem interesse em ingressar no segmento de Desenvolvimento de Software, seja voc&ecirc; estudante ou profissional atuante em outro setor.</p>
        <p>O Brasil &eacute; um país de destaque nesse setor que se fortalece ano ap&oacute;s ano, são v&aacute;rias as oportunidades de trabalho/neg&oacute;cios e a demanda por profissionais qualificados &eacute; grande!</p>
        <p>O primeiro curso completo de forma&ccedil;&atilde;o de profissionais na &aacute;rea de desenvolvimento de softwares que vai desde o b&aacute;sico at&eacute; a pr&aacute;tica, fornecendo uma base para voc&ecirc; se especializar em diferentes e promissoras carreiras: programa&ccedil;&atilde;o Web, telefone celular, rob&oacute;tica, automa&ccedil;&atilde;o residencial ou industrial, e muito mais.</p>
        
        
        <p>A Academia do Programador &eacute; composta por diferentes cursos onde voc&ecirc; vai aprender todos os fundamentos e teorias necess&aacute;rias para desenvolver softwares de diferentes tipos profissionalmente. </p>
        <p>Durante a Academia do Programador voc&ecirc; vai aprender sobre: </p>
        <ul>
        	<li>L&oacute;gica de programa&ccedil;&atilde;o</li>
        	<li>Sintaxe b&aacute;sica da linguagem Java e C++</li>
        	<li>Conceitos fundamentais de hardware do PC e sistema operacional Linux</li>
        	<li>Configurar, modelar e usar banco de dados MySQL</li>
        	<li>Fundamentos da Internet: redes, protocolos, html e cria&ccedil;&atilde;o de sites e domínios</li>
        </ul>
        <p>Ao t&eacute;rmino voc&ecirc; vai estar pronto para se especializar em alguma das diversas linguagens de programa&ccedil;&atilde;o do mercado, tais como: Java, C, C#, Ruby, Python, PHP e muitas outras.</p>
        <p>Ao ingressar na Academia do Programador voc&ecirc; receber&aacute;: </p>
        <ul>
        	<li>Apostila com mais de 300 p&aacute;ginas</li>
        	<li>Direito de acesso a todos os laborat&oacute;rios pr&aacute;ticos e solu&ccedil;&otilde;es</li>
        	<li>Direito de participar da comunidade Academia do Programador na internet onde oferecemos um suporte diferenciado para ex-alunos</li>
        </ul>
        <br/>
        
        
        <h3>Cursos</h3>
        <p>Esta carreira &eacute; composta pelos seguintes cursos, que totalizam uma carga hor&aacute;ria de 80 horas.</p>
        
        <br/>
        <table class="stats" cellspacing="0">
        	<thead>
        		<tr><td class="hed">Codigo</td><td class="hed">Nome</td><td class="hed">Carga Horaria</td></tr>
        	</thead>
        	<tbody>
        		<tr><td>AP1</td><td>L&oacute;gica de Programa&ccedil;&atilde;o com Java e Program-ME</td><td>40 hs</td></tr>
        		<tr><td>AP2</td><td>Hardware e Sistemas operacionais</td><td>8 hs</td></tr>
        		<tr><td>AP3</td><td>Banco de dados com MySQL</td><td>8 hs</td></tr>
        		<tr><td>AP4</td><td>Redes e Internet</td><td>16 hs</td></tr>
        		<tr><td>AP5</td><td>Desenvolvimento na pr&aacute;tica</td><td>8 hs</td></tr>
        	</tbody>
        	<tfoot><tr><td></td><td>Total de Horas</td><td>80 hs</td></tr></tfoot>
        </table>
        <br/>
        <h3>O único pr&eacute;-requisito &eacute; gostar de computador!</h3>
        <p>A Academia do Programador não tem pr&eacute;-requisitos t&eacute;cnicos, basta voc&ecirc; saber usar o computador no seu dia-a-dia. Na Academia do Programador voc&ecirc; vai entender como funcionam as coisas nos bastidores do seu computador: desde os sinais el&eacute;tricos digitais 0 e 1 at&eacute; os sofisticados sistemas de internet.</p>
        
        <br/>
        <h3>Introdu&ccedil;&atilde;o a Rob&oacute;tica</h3>
        <p>Este treinamento prepara voc&ecirc; com o que &eacute; de mais fundamental para voc&ecirc; poder se especializar em programa&ccedil;&atilde;o de rob&ocirc;s e eletr&ocirc;nica. Voc&ecirc; vai receber junto com o material did&aacute;tica o dispositivo Program-ME que &eacute; uma base eletr&ocirc;nica para incentivar seus estudos b&aacute;sicos, mas que tamb&eacute;m &eacute; um poderoso controlador de rob&ocirc;s.</p>
        
        <br/>
        <h3>Aprendizado e diversão: Program-ME</h3>
        <p>Conhecendo os desafios para iniciar na &aacute;rea de programa&ccedil;&atilde;o, a Globalcode desenvolveu um dispositivo de apoio a ensino de l&oacute;gica de programa&ccedil;&atilde;o chamado <a href="http://www.globalcode.com.br/site/noticias/painel.seam?chave=entrevistaProgramMe">Program-ME</a>. Com ele fica muita mais f&aacute;cil e intuitivo aprender a programar pois seus programas terão efeitos visuais, sonores e responderam a sensores, tornando mais divertido aprender e superar esta importante etapa inicial.</p>
        <p>O Program-ME &eacute; baseado em Arduino um poderoso e acessível microcontrolador que pode ser usado para MUITAS coisas:</p>
        <ul>
        	<li>Controlar motores de m&aacute;quinas e rob&ocirc;s</li>
        	<li>Automa&ccedil;&atilde;o residencial com sensores de presen&ccedil;a, calor, luz, controle de tomadas, infravermelho</li>
        	<li>Integrar m&aacute;quinas e aparelhos</li>
        </ul>
        <br/>
        
        <a href="http://www.globalcode.com.br/site/treinamentos/carreira.seam?id=747" target="open">Veja mais detalhes sobre a carreira.</a>
	  </div>
	
      <div id="cabecalho">
	    <ul id="nav">
		  <li><a href="/index.html">Home</a></li>
		  <li><a href="/sobre/sobre.html">Quem somos</a></li>
		  <li><a href="/treinamentos/treinamentos.html">Treinamentos</a></li>
		  <li><a href="/consultoria/consultoria.html">Consultoria</a></li>
  		  <li><a href="/contato/contato.html">Contato</a></li>
  		  <li class="last"><a href="/open/open.html">Open</a></li>
	    </ul>
	    
	    <img alt="YaW Tecnologia - Compartilhando conhecimento" src="/images/yaw.png"/>
	  </div>
	  
	  <div id="sidebar">
	  	<div id="agendaTurmas2">
      	  <div>
      	    <br/>
      	    <span>Pr&oacute;ximas turmas</span>
      	    <br/><br/>
      	    <ul>
      	      <li><a href="/treinamentos/academiaJava.html">Academia Java</a></li>
      	      <li class="dia">01&#47;Fev&#47;2011 &#45; <a href="mailto:abc@globalcode.com.br?subject=Solicitacao de pre-matricula na turma AJABCT05" title="clique para solicitar pr&eacute;&#45;matr&#105;cula por e&#45;mail" target="_blank">Pr&eacute;&#45;Matr&#105;cula</a></li>
      	      <li>Terças e Quintas, das 19 &aacute;s 23 h</li>
      	    </ul>
      	    <br/>
      	    <ul>
      	      <li><a href="/treinamentos/academiaWeb.html">Academia Web</a></li>
      	      <li class="dia">11&#47;Mai&#47;2011 &#45; <a href="mailto:abc@globalcode.com.br?subject=Solicitacao de pre-matricula na turma AJABCT05" title="clique para solicitar pr&eacute;&#45;matr&#105;cula por e&#45;mail" target="_blank">Pr&eacute;&#45;Matr&#105;cula</a></li>
      	      <li>Segundas e Quartas, das 19 &aacute;s 23 h</li>
      	    </ul>
      	  </div>
      	</div>
  
  		<br/><br/>
  
  	  	<div id="inner">
			<br/>
			<p>Resultados e Objetivos</p>
			<br/>
			<span class="orangeTitle">Ao concluir a carreira voc&ecirc; estar&aacute; apto:</span>
			<ul>
				<li>Aplicar conceitos de l&oacute;gica de programa&ccedil;&atilde;o na pr&aacute;tica com Java e C</li>
				<li>Dominar os fundamentos da linguagem Java e C: vari&aacute;veis, coment&aacute;rios, condi&ccedil;&otilde;es, la&ccedil;os, procedimentos, fun&ccedil;&otilde;es / m&eacute;todos (não inclui orienta&ccedil;&atilde;o a objetos)</li>
				<li>Preparar um computador para escrever, compilar, depurar e executar programas Java utilizando NetBeans, Eclipse, JDK e reposit&oacute;rio CVS.</li>
				<li>Trabalhar com b&aacute;sico de eletr&ocirc;nica e computa&ccedil;&atilde;o física usando Program-ME e Arduino</li>
				<li>Preparar um computador Linux para desenvolvimento com C utilizando GCC e Arduino</li>
				<li>Identificar principais pe&ccedil;as de um computador PC, sua arquitetura e tamb&eacute;m diagn&oacute;stico b&aacute;sico de falhas</li>
				<li>Instalar, modelar e usar o MySQL entendendo os conceitos fundamentais de banco de dados relacional e os principais comandos</li>
				<li>Instalar um sistema operacional no computador</li>
				<li>Escrever p&aacute;ginas b&aacute;sicas em HTML bem como dominar os princípios da computa&ccedil;&atilde;o em rede e servi&ccedil;os TCP/IP</li>
				<li>Desenvolver um aplicativo Web usando banco de dados</li>
				<li>Utilizar o servidor Apache Tomcat para instalar e testar aplica&ccedil;&otilde;es Java para web</li>
				<li>Ingressar em um treinamento especializado em Java como Core Java ou Academia do Java, ou se especializar em qualquer outra linguagem de programa&ccedil;&atilde;o</li>
			</ul>
			<br/>
		</div>
	  </div>
	  <div id="push"><div></div></div>
	
	</div>
	<div id="push"><div></div></div>
	<div id="rodape">
	  <div>
		<br/>
		<span>Av. Lucas Nogueira Garcez, 439, Sala 3 &#45; Centro &#45; S&atilde;o Bernardo do Campo &#45; <a href="http://bit.ly/8OV3cx" target="open">Veja o mapa.</a></span><br/>
		<span>Telefone: &#40;55&#41; &#40;11&#41; 2988-1540 &amp; &#40;55&#41; &#40;11&#41; 2988-1840 </span><br/>
		<span>contato@yaw.com.br</span>
		<p>Copyright &copy; 2010 YAW IT</p>
		<p>
		  <a href="http://twitter.com/youandwe" target="open"><img src="/images/twitter.png" alt="Yaw no Twitter" title="Yaw no Twitter" /></a>
		  <a href="http://www.linkedin.com/companies/696761" target="open"><img src="/images/linkedin.jpg" alt="Yaw no LinkedIn" title="Yaw no LinkedIn" /></a>
		  <a href="http://www.facebook.com/profile.php?id=100000520054799" target="open"><img src="/images/facebook.png" alt="Yaw no Facebook" title="Yaw no Facebook" /></a>
		  <a href="http://www.orkut.com.br/Main#Community?cmm=96436632" target="open"><img src="/images/orkut.png" alt="Yaw no Orkut" title="Yaw no Orkut" /></a>
		</p>
	  </div>
	</div>
	
	<script type="text/javascript">
	  var gaJsHost = (("https:" == document.location.protocol) ? "https://ssl." : "http://www.");
	  document.write(unescape("%3Cscript src='" + gaJsHost + "google-analytics.com/ga.js' type='text/javascript'%3E%3C/script%3E"));
	</script>
	<script type="text/javascript">
	  try {
	    var pageTracker = _gat._getTracker("UA-12028419-1");
	    pageTracker._trackPageview();
	  } catch(err) {}
	</script>
  </body>

</html>