<?xml version="1.0" encoding="ISO-8859-1" ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">

<html xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1" />
    <meta http-equiv="Content-Language" content="pt-br" />
    <meta name="description" lang="pt-br" content="Yaw Tecnologia &eacute; uma empresa de desenvolvimento de Software, treinamentos, cursos Java, cursos de An&aacute;lise de Requisitos" />
    <meta name="keywords" lang="pt-br" content="curso de java, cursos java, cursos de java, treinamentos java, aprendendo java, cursos java no abc, treinamentos java grande abc" />
    <link rel="shortcut icon" href="/favicon.ico" type="image/x-icon" />
    
    <link rel="stylesheet" type="text/css" href="/css/yaw.css" />
  </head>

  <body>
    <div id="wrapper">
      <div id="content">
        <img src="/images/logo_ac_web.png" style="margin: 0pt 5px;" alt="Logo Academia Web" title="Carreira Academia Web" align="left"/>
        <br/>
        <br/>
        <h2>Academia Web Developer</h2><br/>
        <span class="boldTitle">Html, CSS, JavaScript, JSP, Servlet, Struts, JavaServer Faces, Facelets, Ajax/RichFaces e JPA</span>
        <br/><br/>
        
        <p>A carreira Academia Web &eacute; voltada aos profissionais que j&aacute; atuam com a plataforma Java, tais como programadores, arquitetos, analistas e gerentes t&eacute;cnicos, que desejam conhecer e trabalhar com os recursos web da plataforma Java Enterprise Edition (JEE), utilizando servlets e JavaServer Pages (JSP) e os principais frameworks do mercado.</p>
        <p>Existe uma grande demanda no mercado por desenvolvedores que dominam as tecnologias JSP e servlets, e os principais frameworks para web e persist&ecirc;ncia. A Academia Web Developer, al&eacute;m de apresentar os conceitos fundamentais do desenvolvimento web, engloba tamb&eacute;m as tecnologias mais recentes como JSP 2.0, Servlets 2.4 e JSF 1.1/1.2 e os mais populares frameworks Java, com enfoque em Struts e Hibernate, al&eacute;m de mostrar a utiliza&ccedil;&atilde;o de ferramentas essenciais como Ant, Tomcat, Eclipse, NetBeans e JasperReports.</p>
        <p>Este treinamento &eacute; composto de seis cursos que abordam todas as partes do projeto de uma aplica&ccedil;&atilde;o web. O aluno aprende a utilizar funcionalidades para web de ferramentas de desenvolvimento Java e a criar telas din&acirc;micas complexas usando v&aacute;rias tecnologias web. Al&eacute;m disso o aluno tamb&eacute;m aprende a realizar a persist&ecirc;ncia de dados com acesso a dados por meio do mapeamento objeto-relacional e se prepara para compreender e definir arquiteturas de aplica&ccedil;&otilde;es web. Como um benefício adicional, o aluno estuda e pratica todos os t&oacute;picos da certifica&ccedil;&atilde;o oficial Sun Certified Web Component Developer (SCWCD).</p>
        <br/>
        
        <h3>Cursos</h3>
        <p>Esta carreira &eacute; composta pelos seguintes cursos, que totalizam uma carga hor&aacute;ria de 124 horas.</p>
        
        <br/>
        <table class="stats" cellspacing="0">
        	<thead>
        		<tr><td class="hedRed">Codigo</td><td class="hedRed">Nome</td><td class="hedRed">Carga Horaria</td></tr>
        	</thead>
        	<tbody>
        		<tr><td>AW1</td><td>Desenvolvimento Avan&ccedil;ado de Interfaces Web com HTML, CSS e JavaScript</td><td>16 hs</td></tr>
        		<tr><td>AW2</td><td>Desenvolvimento Web com J2EE: JSP 2.0, Servlets 2.4 e Design-patterns</td><td>36 hs</td></tr>
        		<tr><td>AW3</td><td>Desenvolvimento Web com Struts </td><td>16 hs</td></tr>
        		<tr><td>AW4</td><td>Desenvolvimento Web com JavaServer Faces</td><td>24 hs</td></tr>
        		<tr><td>AW5</td><td>Desenvolvimento da camada de persist&ecirc;ncia com Hibernate</td><td>20 hs</td></tr>
        		<tr><td>AW6</td><td>Desenvolvimento de relat&oacute;rios com JasperReports e iReport</td><td>12 hs</td></tr>
        	</tbody>
        	<tfoot><tr><td></td><td>Total de Horas</td><td>124 hs</td></tr></tfoot>
        </table>
        <br/>
        <h3>O que eu vou aprender na Academia Web Developer ?</h3>
        <p>A Academia Web Developer &eacute; composta por 6 cursos especializados em Java, sendo que o primeiro curso AW1 - Desenvolvimento Avan&ccedil;ado de Interfaces Web com HTML, CSS e JavaScript &eacute; focado em HTML, CSS e JavaScript, mas n&atilde;o da perspectiva de um Web Designer, mas sim de um programador Java.</p>
        <p>O segundo curso AW2 Desenvolvimento Web com Java EE aborda as principais APIs Java EE para desenvolvimento Web, essenciais para a certifica&ccedil;&atilde;o Sun Certified Web Component Developer (SCWCD) : JavaServer Pages (JPS), Servlets e Bibliotecas de Tags abordando detalhadamente t&oacute;picos fundamentais como Expression Language, manipula&ccedil;&atilde;o de sess&atilde;o, etc.</p>
        <p>O terceiro curso desta carreira  AW3 - Desenvolvimento Web com Struts aborda um dos frameworks mais populares do mercado, o Jakarta Struts. Embora grande parte dos novos projetos n&atilde;o optem por utilizar Struts o número de projetos que j&aacute; utilizam &eacute; muito grande.</p>
        <p>O quarto curso desta carreira AW4 - Desenvolvimento com JavaServer Faces aborda detalhadamente este framework, que faz parte da especifica&ccedil;&atilde;o de Java EE 5, uma das principais escolhas dos arquitetos para desenvolvimento de aplica&ccedil;&otilde;es Web atualmente.</p>
        <p>A carreira tem continuidade com o curso de Hibernate AW5 - Desenvolvimento da camada de persist&ecirc;ncia com Hibernate complementa o desenvolvimento de aplica&ccedil;&otilde;es Web abordando o mais importante framework de persist&ecirc;ncia Java.</p>
        <p>E para finalizar apresentamos o curso de iReport e JasperReports AW6 - Desenvolvimento de relat&oacute;rios.</p>
        <p>Ou seja, voc&ecirc; tem uma forma&ccedil;&atilde;o completa, respeita sua curva de aprendizado e est&aacute; pronto para o mercado e para mais uma certifica&ccedil;&atilde;o Java.</p>
        
        <a href="http://www.globalcode.com.br/site/treinamentos/carreira.seam?id=725" target="open">Veja mais detalhes sobre a carreira.</a>
	  </div>
	
      <div id="cabecalho">
	    <ul id="nav">
		  <li><a href="/index.html">Home</a></li>
		  <li><a href="/sobre/sobre.html">Quem somos</a></li>
		  <li><a href="/treinamentos/treinamentos.html">Treinamentos</a></li>
		  <li><a href="/consultoria/consultoria.html">Consultoria</a></li>
  		  <li class="last"><a href="/contato/contato.html">Contato</a></li>
	    </ul>
	    
	    <img alt="YaW Tecnologia - Compartilhando conhecimento" src="/images/yaw.png"/>
	  </div>
	  
	  <div id="sidebar">
	  	<div id="agendaTurmas2">
      	  <div>
      	    <br/>
      	    <span>Pr&oacute;ximas turmas</span>
      	    <br/><br/>
      	    <ul>
      	      <li><a href="/treinamentos/academiaJava.html">Academia Java</a></li>
      	      <li class="dia">16&#47;Mar&#47;2010 &#45; <a href="mailto:abc@globalcode.com.br?subject=Solicitacao de pre-matricula na turma AJTABC02" title="clique para solicitar pr&eacute;&#45;matr&#105;cula por e&#45;mail" target="_blank">Pr&eacute;&#45;Matr&#105;cula</a></li>
      	      <li>Ter&ccedil;a e Quinta das 19 &aacute;s 23 h</li>
      	    </ul>
      	    <br/>
      	    <ul>
      	      <li><a href="/treinamentos/academiaWeb.html">Academia Web Developer</a></li>
      	      <li class="dia">29&#47;Mar&#47;2010 &#45; <a href="mailto:abc@globalcode.com.br?subject=Solicitacao de pre-matricula na turma AWT1ABC" title="clique para solicitar pr&eacute;&#45;matr&#105;cula por e&#45;mail" target="_blank">Pr&eacute;&#45;Matr&#105;cula</a></li>
      	      <li>Segunda e Quarta das 19 &aacute;s 23 h</li>
      	    </ul>
      	    <br/>
      	    <ul>
      	      <li><a href="/treinamentos/academiaProgramador.html">Academia do Programador</a></li>
      	      <li class="dia">12&#47;Abr&#47;2010 &#45; <a href="mailto:abc@globalcode.com.br?subject=Solicitacao de pre-matricula na turma APTABC01" title="clique para solicitar pr&eacute;&#45;matr&#105;cula por e&#45;mail" target="_blank">Pr&eacute;&#45;Matr&#105;cula</a></li>
      	      <li>Segunda e Quarta das 19 &aacute;s 23 h</li>
      	    </ul>
      	    <br/>
      	    <ul>
      	      <li><a href="/treinamentos/handsonJPA.html">Hands-on JPA</a></li>
      	      <li class="dia">26&#47;Abr&#47;2010 &#45; <a href="mailto:abc@globalcode.com.br?subject=Solicitacao de pre-matricula na turma JPAT1ABC" title="clique para solicitar pr&eacute;&#45;matr&#105;cula por e&#45;mail" target="_blank">Pr&eacute;&#45;Matr&#105;cula</a></li>
      	      <li>Segunda e Quarta das 19 &aacute;s 23 h</li>
      	    </ul>
      	  </div>
      	</div>
  
	  	<br/><br/>
	  	
		<div id="inner">
			<br/>
			<p>Resultados e Objetivos</p>
			<br/>
			<span class="redTitle">Ao concluir a carreira voc&ecirc; estar&aacute; apto:</span>
			<ul>
				<li>Criar p&aacute;ginas web est&aacute;ticas com HTML, CSS e JavaScript</li>
				<li>Criar p&aacute;ginas din&acirc;micas com JSP e taglibs</li>
				<li>Trabalhar com servlets e requisi&ccedil;&otilde;es e respostas HTTP</li>
				<li>Empacotar aplica&ccedil;&otilde;es web e instal&aacute;-las e gerenci&aacute;-las no Tomcat</li>
				<li>Definir a arquitetura de aplica&ccedil;&otilde;es, usando o padr&atilde;o MVC (Model-View-Controller)</li>
				<li>Utilizar o Struts para implementar aplica&ccedil;&otilde;es web bem-estruturadas</li>
				<li>Utilizar a tecnologia JSF para criar p&aacute;ginas din&acirc;micas baseadas em componentes e eventos</li>
				<li>Programar a persist&ecirc;ncia de objetos usando o Hibernate</li>
				<li>Criar relat&oacute;rios e gr&aacute;ficos em ambiente web utilizando o JasperReports e o iReport</li>
				<li>Utilizar os principais recursos de IDEs open source Eclipse e/ou NetBeans para o desenvolvimento web</li>
			</ul>
			<br/>
		</div>
	  </div>
	  
	  <div id="push"><div></div></div>
	</div>
	<div id="push"><div></div></div>
	<div id="rodape">
	  <div>
		<br/>
		<span>Av. Lucas Nogueira Garcez, 439, Sala 3 &#45; Centro &#45; S&atilde;o Bernardo do Campo &#45; <a href="http://bit.ly/8OV3cx" target="open">Veja o mapa.</a></span><br/>
		<span>Telefone: &#40;55&#41; &#40;11&#41; 2988-1540 &amp; &#40;55&#41; &#40;11&#41; 2988-1840 </span><br/>
		<span>contato@yaw.com.br</span>
		<p>Copyright &copy; 2009 YAW IT</p>
		<p>
		  <a href="http://twitter.com/youandwe" target="open"><img src="/images/twitter.png" alt="Yaw no Twitter" title="Yaw no Twitter" /></a>
		  <a href="http://www.linkedin.com/companies/696761" target="open"><img src="/images/linkedin.jpg" alt="Yaw no LinkedIn" title="Yaw no LinkedIn" /></a>
		  <a href="http://www.facebook.com/profile.php?id=100000520054799" target="open"><img src="/images/facebook.png" alt="Yaw no Facebook" title="Yaw no Facebook" /></a>
		  <a href="http://www.orkut.com.br/Main#Community?cmm=96436632" target="open"><img src="/images/orkut.png" alt="Yaw no Orkut" title="Yaw no Orkut" /></a>
		</p>
	  </div>
	</div>
	
	<script type="text/javascript">
	  var gaJsHost = (("https:" == document.location.protocol) ? "https://ssl." : "http://www.");
	  document.write(unescape("%3Cscript src='" + gaJsHost + "google-analytics.com/ga.js' type='text/javascript'%3E%3C/script%3E"));
	</script>
	<script type="text/javascript">
	  try {
	    var pageTracker = _gat._getTracker("UA-12028419-1");
	    pageTracker._trackPageview();
	  } catch(err) {}
	</script>
  </body>

</html>